<?php
// config/business.php

return [
	/*
    |--------------------------------------------------------------------------
    | 貨幣主題色
    |--------------------------------------------------------------------------
    */
	'currency_theme_map' => [
        'TWD' => 'blue',
        'CNY' => 'red', 
        'HKD' => 'green',
        'USD' => 'purple',
    ],
	/*
    |--------------------------------------------------------------------------
    | 帳戶類型主題色映射 (也可單獨抽離)
    |--------------------------------------------------------------------------
    */
    'account_theme_map' => [
        'cash'       => 'orange',
        'bank'       => 'blue',
        'e-wallet'   => 'green',
        'securities' => 'purple',
    ],
    /*
    |--------------------------------------------------------------------------
    | 帳戶類型 (Account Types)
    |--------------------------------------------------------------------------
    */
    'account_types' => [
        'cash' => [
            'name' => '現金',
            'icon' => 'heroicon-o-currency-dollar',
        ],
        'bank' => [
            'name' => '銀行',
            'icon' => 'heroicon-o-building-library',
        ],
        'e-wallet' => [
            'name' => '網絡支付',
            'icon' => 'heroicon-o-device-phone-mobile',
        ],
        'securities' => [
            'name' => '證券帳戶',
            'icon' => 'heroicon-o-arrow-trending-up',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | 其他業務邏輯預留
    |--------------------------------------------------------------------------
    */
    'payment_methods' => [],
    'expense_items' => [],
    'backup_paths' => [],
];